{
    "business_rules": [
        {
            "id": "BR-01",
            "definition": "All time-based operations and data storage must adhere to the Asia/Ho_Chi_Minh (Vietnam) timezone standard."
        },
        {
            "id": "BR-02",
            "definition": "Username, Email, Staff Code, and Roll Number must be unique across the system."
        },
        {
            "id": "BR-03",
            "definition": "Major Code and Major Name must be unique."
        },
        {
            "id": "BR-04",
            "definition": "Semester Code and Semester Name must be unique."
        },
        {
            "id": "BR-05",
            "definition": "Subject Code must be unique."
        },
        {
            "id": "BR-06",
            "definition": "A subject must be linked to at least one major upon creation."
        },
        {
            "id": "BR-07",
            "definition": "Room Name must be unique."
        },
        {
            "id": "BR-08",
            "definition": "Camera Name and RTSP URL must be unique across the system."
        },
        {
            "id": "BR-09",
            "definition": "A camera must be assigned to an existing room."
        },
        {
            "id": "BR-10",
            "definition": "A slot cannot be deactivated if its scheduled start time has arrived or if it already contains Present or Absent attendance records."
        },
        {
            "id": "BR-11",
            "definition": "After the cutoff (23:59:59 Vietnam time), only the Data Operator can edit attendance records."
        },
        {
            "id": "BR-12",
            "definition": "A slot's time range must not overlap with any other slot in the same Room."
        },
        {
            "id": "BR-13",
            "definition": "A slot's time range must not overlap with any other slot assigned to the same Staff User (Lecturer/Supervisor)."
        },
        {
            "id": "BR-14",
            "definition": "Slot End Time must be strictly after the Start Time."
        },
        {
            "id": "BR-15",
            "definition": "Slots must be assigned to an active Room and active Staff."
        },
        {
            "id": "BR-16",
            "definition": "Only Lecturer and Supervisor can perform Scan and Rescan action."
        },
        {
            "id": "BR-17",
            "definition": "Cannot delete a Semester if it has dependent classes."
        },
        {
            "id": "BR-18",
            "definition": "Cannot delete a Major if it has dependent Students or Subjects."
        },
        {
            "id": "BR-19",
            "definition": "Cannot delete a Subject if it has dependent Classes."
        },
        {
            "id": "BR-20",
            "definition": "Cannot delete a Class if it has dependent Slots."
        },
        {
            "id": "BR-21",
            "definition": "Lecturers can work with regular slots and PT (Exam) slots, while Supervisors can only work with Final exam (Exam) slots."
        },
        {
            "id": "BR-22",
            "definition": "Lecturers and Supervisors can only work in assigned slots."
        },
        {
            "id": "BR-23",
            "definition": "Import csv has 2 modes: add and update existing."
        },
        {
            "id": "BR-24",
            "definition": "The system has 3 statuses for attendance: Not yet, Absent, Present."
        },
        {
            "id": "BR-25",
            "definition": "Final Exam attendance only belongs to the slot, not to any class."
        },
        {
            "id": "BR-26",
            "definition": "1 exam slot (Final Exam) can have many subjects."
        },
        {
            "id": "BR-27",
            "definition": "There are 3 types of Slots: Lecture, Lecture with PT, Final Exam."
        },
        {
            "id": "BR-28",
            "definition": "Data operators cannot create other Data operators."
        },
        {
            "id": "BR-29",
            "definition": "Data Operator cannot assign roles related to Lecturer and Supervisor to a Student and vice versa."
        },
        {
            "id": "BR-30",
            "definition": "Lecturers can only perform Scan and Rescan within the time range of the class slot."
        },
        {
            "id": "BR-31",
            "definition": "Lecturers can manually adjust student attendance until 23:59:59 of the day with that slot."
        },
        {
            "id": "BR-32",
            "definition": "Lecturers and Supervisors can only export data of their own slots and classes."
        }
    ]
}